import pytest

from src.widget import get_date


def test_get_date():

    assert (
        get_date("2025-06-20T15:30:45.123456") == "20.06.2025"
    ), "Стандартный ISO-формат"
    assert (
        get_date("2024-12-31T23:59:59.999999") == "31.12.2024"
    ), "Стандартный ISO-формат"
    assert get_date("2025-07-04T12:34:56.789") == "04.07.2025", "Без дробных секунд"
    assert (
        get_date("2000-01-01T00:00:00.000000") == "01.01.2000"
    ), "Начало тысячечелетия"
    assert get_date("1900-03-20T15:30:00.000000") == "20.03.1900", "Начало века"
    assert get_date("2020-02-29T00:00:00.000000") == "29.02.2020", "Високосный год"
    assert get_date("") == "None", "Пустая строка"
    assert get_date("2025-13-04") == "неверный формат даты", "Некорректная дата"
